Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтатусыФизическихЛицНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыФизическихЛицНалогоплательщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Резидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявлениеНаПредоставлениеВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаПредоставлениеВычетовИПН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрименениеВычетовИПН</xr:Item>
				<xr:Item>InformationRegister.ВычетыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ЛьготыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ПрочиеВычетыФизическихЛицИПН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьСтандартныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьСтандартныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЛицаПолучателяЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЛицПолучателейЛьготИПН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПодтверждающийПравоНаЛьготу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПрочиеВычеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЗаявления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВычетаИПН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПодтверждающийПравоНаВычет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВычетаИПН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставлятьВычет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Сотрудники/Forms/Налоги/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Заголовок,ДатаПриема,ТекущаяОрганизация, ФизическоеЛицоСсылка, СотрудникСсылка");
	СотрудникСсылка = Параметры.СотрудникСсылка;
	ФизическоеЛицоСсылка = Параметры.ФизическоеЛицоСсылка;
	СозданиеНового = Параметры.СозданиеНового;
	
	ДоступноИзменениеНалоговИВзносов = Пользователи.РолиДоступны("ДобавлениеИзменениеНалоговИВзносов");
	
	Элементы.ДоходыСПредыдущегоМестаРаботы.Видимость = ДоступноИзменениеНалоговИВзносов;
	
	Если ЗначениеЗаполнено(ТекущаяОрганизация) Тогда
		ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(ТекущаяОрганизация);
	Иначе
		ГоловнаяОрганизация = Параметры.ГоловнаяОрганизация;
	КонецЕсли;
		
	ЦветСтиляРасширеннойПодсказки = Элементы.ГруппаИнфо.ЦветТекстаЗаголовка;
	ЦветСтиляПоясняющийОшибкуТекст = ЦветаСтиля.ПоясняющийОшибкуТекст;
	
	СотрудникиФормы.ПрочитатьДанныеИзХранилищаВФорму(
		ЭтаФорма,
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(ИмяФормы),
		Параметры.АдресВХранилище);
		
	ПроинициализироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СотрудникиКлиент.ЗарегистрироватьОткрытиеФормы(ЭтаФорма, "Налоги");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СотрудникиКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ОтредактированаИстория" И ФизическоеЛицоСсылка = Источник Тогда
		
		Если Параметр.ИмяРегистра = "СтатусФизическихЛицКакНалогоплательщиков" Тогда
			Если СтатусФизическихЛицКакНалогоплательщиковНаборЗаписейПрочитан Тогда
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
					ЭтаФорма,
					ФизическоеЛицоСсылка,
					ИмяСобытия,
					Параметр,
					Источник);
				КонецЕсли;
				ОбновитьПолеСтатусПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененыВычеты" И Параметр = ЭтаФорма.ФизическоеЛицоСсылка Тогда
		
		ПрочитатьСведенияОВычетахИЛьготахИПН();
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(
		ЭтаФорма,
		"СтатусФизическихЛицКакНалогоплательщиков",
		ФизическоеЛицоСсылка,
		Отказ);
		
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковСтатусПриИзменении(Элемент)
	ОбновитьПолеСтатусПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	
	Если СтатусФизическихЛицКакНалогоплательщиков.Статус = ПредопределенноеЗначение("Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент") Тогда
		СтатусФизическихЛицКакНалогоплательщиков.ИмеетПравоНаПенсионноеОбеспечение = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойПриИзменении(Элемент)

	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтаФорма,
		"СтатусФизическихЛицКакНалогоплательщиковПериод",
		"СтатусФизическихЛицКакНалогоплательщиковПериодСтрокой",
		Модифицированность);

	СтатусФизическихЛицКакНалогоплательщиков.Период = СтатусФизическихЛицКакНалогоплательщиковПериод;
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Оповещение = Новый ОписаниеОповещения("СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"СтатусФизическихЛицКакНалогоплательщиковПериод",
		"СтатусФизическихЛицКакНалогоплательщиковПериодСтрокой", ,
		Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт

	СтатусФизическихЛицКакНалогоплательщиков.Период = СтатусФизическихЛицКакНалогоплательщиковПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтаФорма,
		"СтатусФизическихЛицКакНалогоплательщиковПериод",
		"СтатусФизическихЛицКакНалогоплательщиковПериодСтрокой",
		Направление,
		Модифицированность);

	СтатусФизическихЛицКакНалогоплательщиков.Период = СтатусФизическихЛицКакНалогоплательщиковПериод;
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	СтатусФизическихЛицКакНалогоплательщиков.Период = СтатусФизическихЛицКакНалогоплательщиковПериод;
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковИмеетПравоНаПенсионноеОбеспечениеПриИзменении(Элемент)
	ОбновитьПолеСтатусПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковПодлежитСоциальномуСтрахованиюПриИзменении(Элемент)
	ОбновитьПолеСтатусПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ПериодСведенийСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "ПериодСведений", "ПериодСведенийСтрокой");
	ПрочитатьСведенияОВычетахИЛьготахИПН();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСведенийСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодСведенийНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "ПериодСведений", "ПериодСведенийСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСведенийНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт 
	
	ПрочитатьСведенияОВычетахИЛьготахИПН();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСведенийСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "ПериодСведений", "ПериодСведенийСтрокой", Направление);
	
	ПрочитатьСведенияОВычетахИЛьготахИПН();
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодСведенийСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСведенийСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	ПрочитатьСведенияОВычетахИЛьготахИПН();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтатусФизическихЛицКакНалогоплательщиковИстория(Команда)

	СотрудникиКлиент.ОткрытьФормуРедактированияИстории("СтатусФизическихЛицКакНалогоплательщиков", ФизическоеЛицоСсылка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ИсправитьЗаявлениеНаНаПредоставлениеЛьготИВычетовИПН(Команда)

	ПоказатьЗначение(, ЗаявлениеНаПредоставлениеЛьготИВычетовИПН);

КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеЗаявлениеНаПредоставлениеЛьготИВычетовИПН(Команда)

	УчетНалоговВзносовОтчисленийКлиент.ВвестиНовоеЗаявлениеНаПредоставлениеЛьготИВычетовИПН(ФизическоеЛицоСсылка, ТекущаяОрганизация);

КонецПроцедуры

&НаКлиенте
Процедура ВвестиПрекращениеПредоставленияЛьготИВычетовИПН (Команда)

	УчетНалоговВзносовОтчисленийКлиент.ВвестиДокументПрекращениеПредоставленияЛьготИВычетовИПН(ФизическоеЛицоСсылка, ГоловнаяОрганизация);

КонецПроцедуры

&НаКлиенте
Процедура ВсеЗаявленияНаВычеты(Команда)
	
	Отбор = Новый Структура("Сотрудник", ФизическоеЛицоСсылка);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле.ГиперссылкаЯчейки И ЗначениеЗаполнено(ТекущиеДанные.Расшифровка) Тогда
		ПросмотрГрафикиВычетов(ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	СохранитьИЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроинициализироватьФорму()
	
	ПериодСведений = НачалоМесяца(ТекущаяДата());
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "ПериодСведений", "ПериодСведенийСтрокой");
	
	ПрочитатьСведенияОВычетахИЛьготахИПН();
	
	Если СтатусФизическихЛицКакНалогоплательщиковПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(
			ЭтаФорма,
			"СтатусФизическихЛицКакНалогоплательщиков",
			ФизическоеЛицоСсылка); 
	КонецЕсли; 
		
	УстановитьДоступностьВводаВычетов();
	ОбновитьПолеСтатусПериод(ЭтаФорма, ТекущаяДатаСеанса());
	
	ТолькоСтатусНалогоплательщика = НЕ ДоступноИзменениеНалоговИВзносов ИЛИ НЕ ЗначениеЗаполнено(СотрудникСсылка);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВычетыСтраницы",
		"Видимость",
		НЕ ТолькоСтатусНалогоплательщика);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПериодСведенийСтрокой",
		"Видимость",
		НЕ ТолькоСтатусНалогоплательщика);
	
	Если ТолькоСтатусНалогоплательщика Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"СтатусДоходыГруппа",
			"Отображение",
			ОтображениеОбычнойГруппы.Нет);
			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСведенияОВычетахИЛьготахИПН()
	
	Если НЕ ДоступноИзменениеНалоговИВзносов Тогда
		Возврат;
	КонецЕсли;
	
	ДатаКонтроля = '2018-01-01';
	
	Если ЗначениеЗаполнено(ФизическоеЛицоСсылка) Тогда
		
		Если ПериодСведений >= ДатаКонтроля Тогда
			
			МассивРезультатов = УчетНалоговВзносовОтчислений.ПолучитьСведенияОЛьготахИВычетахИПН(ФизическоеЛицоСсылка,ПериодСведений);
			
			Если МассивРезультатов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			ЗаявлениеНаПредоставлениеЛьготИВычетовИПН	= Неопределено;
			ЗаявлениеНомер								= Неопределено;
			ЗаявлениеДата								= Неопределено;
			СотрудникПоЗаявлению						= Неопределено;
			ОрганизацияПоЗаявлению 						= Неопределено;
			ВычетыПредоставлялись						= Неопределено;
			
			Результат = МассивРезультатов[0];
			Если Результат <> Неопределено Тогда
				ВычетыПредоставлялись						= Истина;
				ЗаявлениеНаПредоставлениеЛьготИВычетовИПН	= Результат.Регистратор;
				ЗаявлениеНомер								= Результат.Номер;
				ЗаявлениеДата								= Результат.Дата;
				ОрганизацияПоЗаявлению						= Результат.Организация;
			КонецЕсли;
			
			Вычеты.Загрузить(МассивРезультатов[1]);
			
		Иначе
			
			МассивРезультатов = УчетНалоговВзносовОтчислений.ПолучитьСведенияОЛьготахИВычетахИПН(ФизическоеЛицоСсылка,ПериодСведений);
			
			Если МассивРезультатов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			ЗаявлениеНаПредоставлениеЛьготИВычетовИПН	= Неопределено;
			ЗаявлениеНомер								= Неопределено;
			ЗаявлениеДата								= Неопределено;
			СотрудникПоЗаявлению						= Неопределено;
			ОрганизацияПоЗаявлению 						= Неопределено;
			
			Результат = МассивРезультатов[0];
			Если Результат.Количество() > 0 Тогда
				ВыборкаСтандартныеВычеты = Результат[0];
				СтандартныеВычетыИПНПредоставлятьСтандартныйВычет = ВыборкаСтандартныеВычеты.ПредоставлятьВычет;
				ЗаявлениеНаПредоставлениеЛьготИВычетовИПН			= ВыборкаСтандартныеВычеты.Регистратор;
				ЗаявлениеНомер								= ВыборкаСтандартныеВычеты.Номер;
				ЗаявлениеДата								= ВыборкаСтандартныеВычеты.Дата;
				СотрудникПоЗаявлению						= ВыборкаСтандартныеВычеты.Сотрудник;
				ОрганизацияПоЗаявлению						= ВыборкаСтандартныеВычеты.Организация;
			КонецЕсли;
			
			Результат = МассивРезультатов[1];
			Если Результат.Количество() > 0 Тогда
				ПрочиеВычетыФизическихЛицИПН.Очистить();
				Для Каждого ВыборкаПрочиеВычеты Из Результат Цикл
					ЗаполнитьЗначенияСвойств(ПрочиеВычетыФизическихЛицИПН.Добавить(), ВыборкаПрочиеВычеты);
					ЗаявлениеНаПредоставлениеЛьготИВычетовИПН	= ВыборкаПрочиеВычеты.Регистратор;
					ЗаявлениеНомер								= ВыборкаПрочиеВычеты.Номер;
					ЗаявлениеДата								= ВыборкаПрочиеВычеты.Дата;
					СотрудникПоЗаявлению						= ВыборкаПрочиеВычеты.Сотрудник;
					ОрганизацияПоЗаявлению						= ВыборкаПрочиеВычеты.Организация;
				КонецЦикла;
			КонецЕсли;
			
			Результат = МассивРезультатов[2];
			Если Результат.Количество() > 0 Тогда
				ВыборкаЛьгота = Результат[0];
				ЛьготаИПНПредоставлятьЛьготу 				 = ВыборкаЛьгота.ПредоставлятьЛьготу;
				ЛьготаИПНКатегорияЛицаПолучателяЛьготы  	 = ВыборкаЛьгота.КатегорияЛицаПолучателяЛьготы; 
				ЛьготаИПНДействуетДо           				 = ВыборкаЛьгота.ДействуетДо; 
				ЛьготаИПНДокументПодтверждающийПравоНаЛьготу = ВыборкаЛьгота.ДокументПодтверждающийПравоНаЛьготу; 
				ЗаявлениеНаПредоставлениеЛьготИВычетовИПН	 = ВыборкаЛьгота.Регистратор;
				ЗаявлениеНомер								 = ВыборкаЛьгота.Номер;
				ЗаявлениеДата								 = ВыборкаЛьгота.Дата;
				СотрудникПоЗаявлению						 = ВыборкаЛьгота.Сотрудник;
				ОрганизацияПоЗаявлению						 = ВыборкаЛьгота.Организация;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗаявлениеНаПредоставлениеЛьготИВычетовИПН.Пустая()
			ИЛИ ЗаявлениеНаПредоставлениеЛьготИВычетовИПН = Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ВычетыСтраницы",
			"ТекущаяСтраница",
			Элементы.ИнфоНадписьОПримененииВычетов);
			
			Если ПериодСведений >= ДатаКонтроля Тогда
				Элементы.ВвестиНовоеЗаявлениеНаПредоставлениеЛьготИВычетовИПН.Заголовок = 
				 НСтр("ru = 'Ввести новое заявление на предоставление вычетов ИПН'");
			КонецЕсли;
			
		Иначе
			
			Если ПериодСведений >= ДатаКонтроля Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				"ВычетыСтраницы",
				"ТекущаяСтраница",
				Элементы.ДанныеОПримененииВычетов);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				"ВычетыСтраницы",
				"ТекущаяСтраница",
				Элементы.ДанныеОПримененииВычетовДо2018);
			КонецЕсли;
			
			ДоступностьИсправитьЗаявлениеНаПредоставлениеЛьготИВычетовИПН = Истина;
			
			Если ОрганизацияПоЗаявлению = НеОпределено Тогда
				
				ЗаявлениеНаПредоставлениеЛьготИВычетовИПНИнфо = НСтр("ru = 'Стандартные вычеты не применяются. Можете ввести заявление о предоставлении стандартных вычетов'");
				ДоступностьИсправитьЗаявлениеНаПредоставлениеЛьготИВычетовИПН = Ложь;
				
			ИначеЕсли ОрганизацияПоЗаявлению <> ГоловнаяОрганизация Тогда
				
				ЗаявлениеНаПредоставлениеЛьготИВычетовИПНИнфо = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вычеты применяются в организации %1. Чтобы начать применение вычетов в организации %2 введите новое заявление о предоставлении вычетов'"),
				ОрганизацияПоЗаявлению,
				ГоловнаяОрганизация);
				ДоступностьИсправитьЗаявлениеНаПредоставлениеЛьготИВычетовИПН = Ложь;
				
			Иначе
				
				ЗаявлениеНаПредоставлениеЛьготИВычетовИПНИнфо = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вычеты предоставляются по заявлению номер %1 от %2'"),
				ЗаявлениеНомер,
				Формат(ЗаявлениеДата,"ДФ='дд ММММ гггг'"));
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИсправитьЗаявлениеНаПредоставлениеЛьготИВычетовИПН",
			"Доступность",
			ДоступностьИсправитьЗаявлениеНаПредоставлениеЛьготИВычетовИПН);
			
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВычетыСтраницы",
		"ТекущаяСтраница",
		Элементы.ИнфоНадписьОПримененииВычетов);
		
	КонецЕсли;
	
	УстановитьИнфоНадписьВычеты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Отказ, ОповещениеЗавершения = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтатусФизическихЛицКакНалогоплательщиков.Статус) Тогда
		ТекстОшибки = НСтр("ru =  'Статус физических лиц как налогоплательщиков: не заполнено поле ""Статус""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "СтатусФизическихЛицКакНалогоплательщиковСтатус", "СтатусФизическихЛицКакНалогоплательщиков.Статус");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не Модифицированность Тогда
		Если ОповещениеЗавершения <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли; 
		
	Если Не СозданиеНового Тогда
		ЗапроситьРежимИзмененияСтатусаНалогоплательщика(СтатусФизическихЛицКакНалогоплательщиков.Период, Отказ, ОповещениеЗавершения);
	Иначе 
		СохранитьДанныеЗавершение(Отказ, ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеЗавершение(Отказ, ОповещениеЗавершения) 
	
	Если Не Отказ Тогда
		
		Если ПроверитьЗаполнение() Тогда
			
			ВозвращаемыйПараметр = Новый Структура;
			ВозвращаемыйПараметр.Вставить("ИмяФормы", ИмяФормы);
			ВозвращаемыйПараметр.Вставить("АдресВХранилище", АдресДанныхДополнительнойФормыНаСервере(СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(ИмяФормы)));
			
			Оповестить(
				"ИзмененыДанныеДополнительнойФормы",
				ВозвращаемыйПараметр,
				ВладелецФормы);
			
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	СохранитьИЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиенте(ЗакрытьФорму = Истина) Экспорт

	Если НЕ ТолькоПросмотр Тогда
		ТекущийЭлемент = Элементы.ФормаОк;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура("ЗакрытьФорму", ЗакрытьФорму);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьДанные(Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиентеЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если Не Отказ И Открыта() Тогда
		
		Модифицированность = Ложь;
		Если ДополнительныеПараметры.ЗакрытьФорму Тогда
			Закрыть();
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияСтатусаНалогоплательщика(ДатаИзменения, Отказ, ОповещениеЗавершения)
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	Оповещение = Новый ОписаниеОповещения("ЗапроситьРежимИзмененияСтатусаНалогоплательщикаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстКнопкиДа = НСтр("ru = 'Изменился статус налогоплательщика'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании изменился статус налогоплательщика. 
						|Если просто исправлены прежние данные (они были ошибочны), нажмите ""Исправлена ошибка"".
						|Если у сотрудника изменился статус с %1, нажмите ""Изменился статус налогоплательщика""'"), 
			Формат(ДатаИзменения, "ДФ='д ММММ гггг ""г""'"));
			
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтаФорма, "СтатусФизическихЛицКакНалогоплательщиков", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияСтатусаНалогоплательщикаЗавершение(Отказ, ДополнительныеПараметры) Экспорт 
	
	СохранитьДанныеЗавершение(Отказ, ДополнительныеПараметры.ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСтатусПериод(Форма, ДатаСеанса)

	СтатусРезидент = ПредопределенноеЗначение("Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент");
	
	Если НЕ ЗначениеЗаполнено(Форма.СтатусФизическихЛицКакНалогоплательщиков.Период) Тогда
		Форма.СтатусФизическихЛицКакНалогоплательщиков.Период = '19000101';
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"СтатусФизическихЛицКакНалогоплательщиковПериодСтрокой",
			"АвтоОтметкаНезаполненного",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"СтатусФизическихЛицКакНалогоплательщиковПериодСтрокой",
			"ОтметкаНезаполненного",
			Ложь);

	КонецЕсли;
	
	Форма.СтатусФизическихЛицКакНалогоплательщиковПериод = Форма.СтатусФизическихЛицКакНалогоплательщиков.Период;
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СтатусФизическихЛицКакНалогоплательщиковПериод", "СтатусФизическихЛицКакНалогоплательщиковПериодСтрокой");
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "СтатусФизическихЛицКакНалогоплательщиков", Форма.ФизическоеЛицоСсылка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИнфоНадписьВычеты(Форма)
	
	ДатаКонтроля = '2018-01-01';
	
	Если Форма.ВычетыПредоставлялись Тогда
		
		ТекстВычетыИнфо = НСтр("ru = 'Вычеты сотруднику сейчас не предоставляются, но ранее предоставлялись. Предыдущие заявления на вычеты можно посмотреть по ссылке ""Все заявления на вычеты""'");
		ЦветТекстаВычетыИнфо = Форма.ЦветСтиляРасширеннойПодсказки;
		
	ИначеЕсли ЗначениеЗаполнено(Форма.ГоловнаяОрганизация) И НЕ Форма.ФизическоеЛицоСсылка.Пустая() Тогда
		
		ТекстВычетыИнфо = НСтр("ru = 'Вычеты сотруднику не предоставляются. Для того чтобы начать применение вычетов, введите %1'");
		ТекстЗаявления = ?(Форма.ПериодСведений >= ДатаКонтроля,НСтр("ru = 'заявление о предоставлении вычетов'"),НСтр("ru = 'заявление о предоставлении льгот и вычетов'"));
		ТекстВычетыИнфо = СтрЗаменить(ТекстВычетыИнфо, "%1",ТекстЗаявления);
		ЦветТекстаВычетыИнфо = Форма.ЦветСтиляРасширеннойПодсказки;
		
	Иначе
		
		Если Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьКадровыйУчет") Тогда
			ТекстВычетыИнфо = НСтр("ru = 'Для ввода заявления о предоставлении стандартных вычетов или уведомления о праве на имущественные вычеты, необходимо оформить прием на работу'");
		Иначе
			Если ЗначениеЗаполнено(Форма.ГоловнаяОрганизация) Тогда
				ТекстВычетыИнфо = НСтр("ru = 'Для ввода заявления о предоставлении льгот и вычетов ИПН запишите сотрудника (Ctrl+S)'");
			Иначе
				ТекстВычетыИнфо = НСтр("ru = 'Для ввода заявления о предоставлении льгот и вычетов ИПН заполните организацию и запишите сотрудника (Ctrl+S)'");
			КонецЕсли;
		КонецЕсли;
		
		ЦветТекстаВычетыИнфо = Форма.ЦветСтиляПоясняющийОшибкуТекст;
		
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.УстановитьРасширеннуюПодсказкуЭлементуФормы(
		Форма,
		"ГруппаИнфо",
		ТекстВычетыИнфо);
		
	Форма.Элементы.ГруппаИнфо.РасширеннаяПодсказка.ЦветТекста = ЦветТекстаВычетыИнфо;

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьВводаВычетов() Экспорт
	
	ДоступностьКоманд = ЗначениеЗаполнено(ГоловнаяОрганизация) И ДоступноИзменениеНалоговИВзносов;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НовоеЗаявлениеНаПредоставлениеВычетов1",
		"Доступность",
		ДоступностьКоманд);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НовоеЗаявлениеНаПредоставлениеВычетов",
		"Доступность",
		ДоступностьКоманд);
	
КонецПроцедуры

&НаСервере
Функция АдресДанныхДополнительнойФормыНаСервере(ОписаниеДополнительнойФормы)
	
	Возврат СотрудникиФормы.АдресДанныхДополнительнойФормы(ОписаниеДополнительнойФормы, ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура ДоходыСПредыдущегоМестаРаботы(Команда)
	СотрудникиКлиент.ОткрытьФормуВводаДоходовСПредыдущегоМестаРаботы(ФизическоеЛицоСсылка, ГоловнаяОрганизация);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрГрафикиВычетов(ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ВидВычетаИПН",					ДанныеСтроки.ВидВычетаИПН);
	ПараметрыОткрытия.Вставить("Месяц",							Дата(1,1,1));
	ПараметрыОткрытия.Вставить("МесяцЗавершения",				Дата(1,1,1));
	ПараметрыОткрытия.Вставить("АдресВХранилищеПрочиеВычеты",	АдресВХранилищеПрочиеВычеты(ДанныеСтроки.ВидВычетаИПН));
	
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",				Истина);
	
	ОткрытьФорму("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Форма.РедактированиеГрафикаВычетов", ПараметрыОткрытия, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеПрочиеВычеты(ВидВычетаИПН) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеВычеты.ВидВычетаИПН,
	|	ПрочиеВычеты.Размер,
	|	ПрочиеВычеты.ДействуетПо,
	|	ПрочиеВычеты.ДействуетС
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПрочиеВычеты КАК ПрочиеВычеты
	|ГДЕ
	|	ПрочиеВычеты.Ссылка = &Ссылка
	|	И ПрочиеВычеты.ВидВычетаИПН = &ВидВычетаИПН";
	Запрос.УстановитьПараметр("Ссылка",ЗаявлениеНаПредоставлениеЛьготИВычетовИПН);
	Запрос.УстановитьПараметр("ВидВычетаИПН",ВидВычетаИПН);
	
	Возврат ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить(), УникальныйИдентификатор);
	
КонецФункции


#КонецОбласти
